AK47n/firstep/library/masters/mspm0/mspm0.syscfg
/**
 * firstep mspm0 母版默认外设布局（地猛星 LCKFB-DMX 开发板，模块库默认引脚方案，
 * 编译闭环用；2026-08-14 地猛星化，工单 mspm0-master-dimx/01）。
 * 实例名/宏名与模块库代码一一对应（PWMAB/DC_MOTOR/IMU601/OLED/NTB/MOTOR_PID/
 * HUIDU/KEY/LED_BEEP/STEP_MOTOR/DCC_100_PWM2/I2C_0）；实际接线不同时改引脚名
 * 即可，实例名与宏名勿动。
 * 引脚方案（除 PB4/PB5 外全部在地猛星 2×20 排针上）：
 *   motor：PWMAB C0/C1→PA12/PA13、DC_MOTOR AIN1=PB9 AIN2=PA18 BIN1=PB18
 *   BIN2=PA7、编码器 AA=PA16 AB=PA17 BA=PB19 BB=PB20
 *   HUIDU：PA22-27/PB4/PB5（R3/R4 的 PB4/PB5 为 LaunchPad 遗留，地猛星未引出）
 *   KEY：PA2（板载 ROSC 偏置 100k 到地，按键与上拉共用此脚）
 *   LED_BEEP：PA15；IR_BEAM：PA8（红外对射 OUT，ir_beam 模块；与
 *   DIGIT_UART 默认重叠，同选时经引脚绑定消解）；IMU601：UART0 =
 *   PA28(TX)/PA31(RX)（板载 CH340E 占
 *   UART0 的 PA10/PA11，勿用）；DIGIT_UART：UART1 = PA8(TX)/PA9(RX)（K230 串口）
 *   OLED：I2C1 = PB3(SDA)/PB2(SCL)；I2C_0：I2C0 = PA0(SDA)/PA1(SCL)（MPU6050，
 *   复用板载 LED 脚——总线空闲高电平 LED 不亮，通信期间微闪；PA1 板载 4.7k 上拉，
 *   PA0 上拉未焊 R12，靠 MPU 板自带）
 *   STEP_MOTOR：RST2/SLP2/DIR2/DCY2 = PB24/PB6/PB7/PB8（全 GPIOB，
 *   STEP_MOTOR_PORT 整组 GPIOB）；DCC_100_PWM2：TIMG12 C0 = PA14（板上经
 *   LED2+15k 到地，PWM 输出时 LED 微亮，可忽略）
 *   JOYSTICK：SW = PA9（摇杆按键，上拉输入低有效；与 DIGIT_UART RX 默认
 *   重叠——手动摇杆与 K230 视觉同选概率最低，同选时经引脚绑定消解）；
 *   ADC12_0 四通道：MEM0 = PA24(A0_3) 归 adc 模块（us016/mq2 薄封装共读同槽），
 *   MEM1 = PA26(A0_1) / MEM2 = PA25(A0_2) 归 joystick 摇杆 X/Y（与
 *   ZIGBEE_UART 默认重叠——手动摇杆与无线身份/信标同选概率最低，同选时
 *   经引脚绑定消解；多 MEM 必须 sequence 模式，2026-09-05 SysConfig CLI
 *   实证），MEM3 = PA27(A0_0) 归 ir_distance（与 HUIDU R2 重叠——红外
 *   测距与灰度巡线同选概率最低）
 *   HC05：HC05_UART = UART2 共享（9600——HC05 出厂默认波特率，与 DEBUG+UWB
 *   同外设；默认 PA23/PA24 与 UWB 同脚——蓝牙与 UWB 链路互替、同选概率
 *   最低，同选时经引脚绑定换实例消解）；STATE = PA8 输入（连接状态，
 *   高有效；与 DIGIT_UART TX/IR_BEAM OUT 重叠——蓝牙与 K230 视觉/红外对射
 *   链路互替）、KEY = PB24 输出（AT 模式切换，与 STEP_MOTOR RST2/SR04 TRIG
 *   重叠——AT 切换不常用，同选经引脚绑定消解）
 *   NRF24L01：软 SPI 6 脚全 GPIOA（CLK=PA26/MOSI=PA25/MISO=PA9/
 *   CSN=PA24/CE=PA23/IRQ=PA22，单 NRF24L01_PORT 宏）——与 ZIGBEE_UART/
 *   UWB/DEBUG_UART/HUIDU 巡线/joystick/adc/DIGIT 默认重叠：NRF 与其它无线
 *   链路互替、同选概率最低，同选时经引脚绑定消解；IRQ 输入不配中断（GPIO
 *   中断只有 GROUP1 一路且被 motor 编码器独占，第二个 GROUP1_IRQHandler 会
 *   链接期冲突——按手册轮询方式接收，见 nrf24l01 模块注释）
 *   IR_REMOTE：OUT = PA26 输入（红外接收头，NEC 忙等解码不占 TIMER；
 *   与 ZIGBEE_TX/joystick X/NRF24L01 CLK 重叠——红外与其它无线/手动输入
 *   互替、同选概率最低，同选时经引脚绑定消解；主循环轮询解码，不注册
 *   GPIO 中断，原因同 NRF24L01）
 *   MAX7219：DIN=PB9/CLK=PA18/CS=PB18 输出（数码管/点阵显示，软 SPI 位
 *   操作不占硬件 SPI——与 DC_MOTOR AIN1/AIN2/BIN1 重叠：大数字显示（计分/
 *   计时/数据牌）与双电机小车同选概率最低，同选时经引脚绑定消解；PA18 兼
 *   BSL 排针脚，作输出无碍）
 *   PCA9685：SCL=PB6/SDA=PB7（16 路舵机驱动板，软 I2C 位操作不占硬件 I2C
 *   外设，SDA 方向运行时切换——与 STEP_MOTOR SLP2/DIR2、HUIDU R3/R4、
 *   AHT10/DHT11 温湿度重叠：多路舵机多自由度执行与温湿度采集/步进（互替）/
 *   巡线车同选概率最低，同选时经引脚绑定消解；软 I2C 需板上/模块自带上拉）
 *   IR_TX：OUT = PA0 输出（红外编码发射，38kHz 载波忙等不占 TIMER——与
 *   I2C_0 SDA（ml_mpu6050 姿态）/板载 LED 重叠：红外发射链与姿态采集同选
 *   概率最低，板载 LED 随载波闪烁可作发射指示；与 IR_REMOTE 默认 PA26 刻意
 *   错开——发射/接收常配对，双选默认即不撞，同选时经引脚绑定消解）
 * 板上固定占用：CH340E PA10/PA11、Flash PB14-17、晶振 PA3-6、板载 LED PA0/PA1、
 * VREF- PA21 直连地、BSL PA18（47k 到 BSL 排针）、SWD PA19/PA20（独立 DEBUG 排针，
 * 用户实物未在 2×20P 上找到 A19/A20）、NRST。2026-08-20 用户实物核验：芯片丝印
 * 可见 42WG4 / ABDL，外周为 48 脚，2×20P 排针分布正确，PA13/PA14 在排针上可用。
 * TI 封装命名中 LQFP(PT)=48 脚、LQFP(PM)=64 脚；当前 SysConfig 仍沿用可工作的
 * LQFP-64(PM) / LP-MSPM0G3507 模型，不以此反推实物脚数。实际地猛星 2×20P
 * 引出范围由 mspm0-dimx 板定义约束，PB4/PB5 为 LaunchPad 遗留模型脚、不在 2×20P 上。
 */
//@cliArgs --device "MSPM0G350X" --package "LQFP-64(PM)" --part "Default"
//@v2CliArgs --device "MSPM0G3507" --package "LQFP-64(PM)"
// @cliArgs --board /ti/boards/LP_MSPM0G3507 --rtos nortos

/**
 * Import the modules used in this configuration.
 */
const PWM     = scripting.addModule("/ti/driverlib/PWM", {}, false);
const PWMAB   = PWM.addInstance();
const DCC_100_PWM2 = PWM.addInstance();
// 舵机（servo 模块：50Hz/20ms 周期，0.5-2.5ms 脉宽映射 0-180°；周期由
// servo_init 按 SERVO_PWM_INST_CLK_FREQ 运行时配置，此处初值仅保证可编译）
const SERVO_PWM = PWM.addInstance();
SERVO_PWM.$name                      = "SERVO_PWM";
SERVO_PWM.clockPrescale              = 1;
SERVO_PWM.timerCount                 = 65535;
SERVO_PWM.peripheral.$assign         = "TIMG8";
SERVO_PWM.peripheral.ccp0Pin.$assign = "PA7";
const TIMER   = scripting.addModule("/ti/driverlib/TIMER", {}, false);
const MOTOR_PID = TIMER.addInstance();
const NTB     = TIMER.addInstance();
const GPIO    = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const DC_MOTOR = GPIO.addInstance();
const HUIDU   = GPIO.addInstance();
const KEY     = GPIO.addInstance();
const WS2812 = GPIO.addInstance();
const HX711 = GPIO.addInstance();
const AHT10 = GPIO.addInstance();
const SR04 = GPIO.addInstance();
const JOYSTICK = GPIO.addInstance();
const HC05 = GPIO.addInstance();
const NRF24L01 = GPIO.addInstance();
const IR_REMOTE = GPIO.addInstance();
const LED_BEEP = GPIO.addInstance();
const STEP_MOTOR = GPIO.addInstance();
const IR_BEAM = GPIO.addInstance();
const UART    = scripting.addModule("/ti/driverlib/UART", {}, false);
const IMU601  = UART.addInstance();
const I2C     = scripting.addModule("/ti/driverlib/I2C", {}, false);
const OLED    = I2C.addInstance();
const I2C_0   = I2C.addInstance();
const SYSCTL  = scripting.addModule("/ti/driverlib/SYSCTL");

/**
 * Write custom configuration values to the imported modules.
 */

// 电机 PWM：双通道 C0/C1（TB6612 左/右 PWM 输入）
PWMAB.$name                      = "PWMAB";
PWMAB.clockPrescale              = 256;
PWMAB.timerCount                 = 2000;
PWMAB.peripheral.$assign         = "TIMG0";
PWMAB.peripheral.ccp0Pin.$assign = "PA12";
PWMAB.peripheral.ccp1Pin.$assign = "PA13";
PWMAB.PWM_CHANNEL_0.$name        = "ti_driverlib_pwm_PWMTimerCC0";
PWMAB.PWM_CHANNEL_0.dutyCycle    = 0;
PWMAB.PWM_CHANNEL_1.$name        = "ti_driverlib_pwm_PWMTimerCC1";
PWMAB.PWM_CHANNEL_1.dutyCycle    = 0;

// 步进电机脉冲输出（step_motor 模块：DCC_100_PWM2_INST，TIMG12 32 位定时器，
// clockPrescale 必须为 1——step_set_speed 按 INST_CLK_FREQ/频率 直算周期；C0 = PA14）
DCC_100_PWM2.$name              = "DCC_100_PWM2";
DCC_100_PWM2.clockPrescale      = 1;
DCC_100_PWM2.timerCount         = 65535;
DCC_100_PWM2.peripheral.$assign = "TIMG12";
DCC_100_PWM2.peripheral.ccp0Pin.$assign = "PA14";
DCC_100_PWM2.PWM_CHANNEL_0.$name        = "ti_driverlib_pwm_DCC100_CC0";
DCC_100_PWM2.PWM_CHANNEL_0.dutyCycle    = 50;

// 电机 PID 调度定时器（10ms 周期中断，pid 模块用；编译闭环只需宏存在）
MOTOR_PID.$name              = "MOTOR_PID";
MOTOR_PID.profile            = "Basic_Periodic";
MOTOR_PID.peripheral.$assign = "TIMG6";

