AK47n/firstep/library/masters/mspm0/mspm0.syscfg
// K230 视觉串口（digit_uart/coord_detect 模块用，RX 中断；PA8/PA9 = UART1）
const DIGIT_UART = UART.addInstance();
DIGIT_UART.$name             = "DIGIT_UART";
DIGIT_UART.profile           = "CONFIG_PROFILE_1";
DIGIT_UART.peripheral.$assign = "UART1";
DIGIT_UART.uartClkSrc        = "BUSCLK";
DIGIT_UART.ovsRate           = "16";
DIGIT_UART.targetBaudRate    = 115200;
DIGIT_UART.enableInternalLoopback = false;
DIGIT_UART.enabledInterrupts = ["RX"];
DIGIT_UART.enableFIFO        = false;
DIGIT_UART.peripheral.rxPin.$assign = "PA9";
DIGIT_UART.peripheral.txPin.$assign = "PA8";

// 调试串口（debug_uart 模块用，RX 中断；UART2 = PA23(TX)/PA22(RX)。
// 与 UWB_UART 默认同 UART2——两模块同选时经引脚绑定换实例消解；
// PA23/PA22 与 HUIDU L2/L1 默认重叠，同选时改绑消解）
const DEBUG_UART = UART.addInstance();
DEBUG_UART.$name             = "DEBUG_UART";
DEBUG_UART.profile           = "CONFIG_PROFILE_1";
DEBUG_UART.peripheral.$assign = "UART2";
DEBUG_UART.uartClkSrc        = "BUSCLK";
DEBUG_UART.ovsRate           = "16";
DEBUG_UART.targetBaudRate    = 115200;
DEBUG_UART.enableInternalLoopback = false;
DEBUG_UART.enabledInterrupts = ["RX"];
DEBUG_UART.enableFIFO        = false;
DEBUG_UART.peripheral.rxPin.$assign = "PA22";
DEBUG_UART.peripheral.txPin.$assign = "PA23";

// UWB 定位串口（uwb_uart 模块用，RX 中断；UART2 = PA23(TX)/PA24(RX)。
// PA23/PA24 与 HUIDU L2/L3 默认重叠——两模块同选时经引脚绑定消解）
const UWB_UART = UART.addInstance();
UWB_UART.$name             = "UWB_UART";
UWB_UART.profile           = "CONFIG_PROFILE_1";
UWB_UART.peripheral.$assign = "UART2";
UWB_UART.uartClkSrc        = "BUSCLK";
UWB_UART.ovsRate           = "16";
UWB_UART.targetBaudRate    = 115200;
UWB_UART.enableInternalLoopback = false;
UWB_UART.enabledInterrupts = ["RX"];
UWB_UART.enableFIFO        = false;
UWB_UART.peripheral.rxPin.$assign = "PA24";
UWB_UART.peripheral.txPin.$assign = "PA23";

// Zigbee DL-20 串口（zigbee_uart 接收 / zigbee_uart_key 发送共享，
// RX 中断；UART3 = PA26(TX)/PA25(RX)。PA26/PA25 与 HUIDU R2/R3 默认
// 重叠——同选时经引脚绑定消解）
const ZIGBEE_UART = UART.addInstance();
ZIGBEE_UART.$name             = "ZIGBEE_UART";
ZIGBEE_UART.profile           = "CONFIG_PROFILE_1";
ZIGBEE_UART.peripheral.$assign = "UART3";
ZIGBEE_UART.uartClkSrc        = "BUSCLK";
ZIGBEE_UART.ovsRate           = "16";
ZIGBEE_UART.targetBaudRate    = 115200;
ZIGBEE_UART.enableInternalLoopback = false;
ZIGBEE_UART.enabledInterrupts = ["RX"];
ZIGBEE_UART.enableFIFO        = false;
ZIGBEE_UART.peripheral.rxPin.$assign = "PA25";
ZIGBEE_UART.peripheral.txPin.$assign = "PA26";

// HC05 蓝牙串口（hc05 模块：9600 8N1 透传——HC05 模块出厂默认波特率，与
// 其余 UART 实例 115200 独立无冲突；RX 中断 + FIFO 关闭；与 DEBUG_UART/
// UWB_UART 默认同 UART2 外设——两模块同选时经引脚绑定换实例消解；默认
// TX=PA23/RX=PA24 与 UWB_UART 同脚：蓝牙手机遥控与 UWB 定位链路互替、
// 同选概率最低，同选时经引脚绑定消解）
const HC05_UART = UART.addInstance();
HC05_UART.$name             = "HC05_UART";
HC05_UART.profile           = "CONFIG_PROFILE_1";
HC05_UART.peripheral.$assign = "UART2";
HC05_UART.uartClkSrc        = "BUSCLK";
HC05_UART.ovsRate           = "16";
HC05_UART.targetBaudRate    = 9600;
HC05_UART.enableInternalLoopback = false;
HC05_UART.enabledInterrupts = ["RX"];
HC05_UART.enableFIFO        = false;
HC05_UART.peripheral.rxPin.$assign = "PA24";
HC05_UART.peripheral.txPin.$assign = "PA23";

// 指纹识别（fingerprint 模块：AS608 串口双向——独立 UART 实例，批次 4 UART
// 可行性调研实证 SysConfig CLI 拒绝同一 UART 外设多实例，故不共享；默认
// UART0（IMU601 原脚 PA28/PA31——身份与姿态同选概率最低，单选裁剪后独占
// UART0，同选时经引脚绑定换实例消解）；57600 = 页面注释 AS608 默认波特率
// （市售 9600 出厂版改 targetBaudRate 一行即可，协议与波特率无关）；
// enabledInterrupts 空 = **轮询接收**（不注册 UART 中断、无 ISR 强符号）
const FINGERPRINT_UART = UART.addInstance();
FINGERPRINT_UART.$name             = "FINGERPRINT_UART";
FINGERPRINT_UART.profile           = "CONFIG_PROFILE_1";
FINGERPRINT_UART.peripheral.$assign = "UART0";
FINGERPRINT_UART.uartClkSrc        = "BUSCLK";
FINGERPRINT_UART.ovsRate           = "16";
FINGERPRINT_UART.targetBaudRate    = 57600;
FINGERPRINT_UART.enableInternalLoopback = false;
FINGERPRINT_UART.enabledInterrupts = [];
FINGERPRINT_UART.enableFIFO        = false;
FINGERPRINT_UART.peripheral.rxPin.$assign = "PA31";
FINGERPRINT_UART.peripheral.txPin.$assign = "PA28";

// OLED（I2C 控制器）
OLED.$name                         = "OLED";
OLED.basicEnableController         = true;
OLED.basicControllerBusSpeed       = 400000;
OLED.intController                 = ["NACK", "TX_DONE"];
OLED.advAnalogGlitchFilter         = "DISABLED";
OLED.peripheral.$assign            = "I2C1";
OLED.peripheral.sdaPin.$assign     = "PB3";
OLED.peripheral.sclPin.$assign     = "PB2";

// MPU6050 姿态传感器（ml_mpu6050 模块：I2C_0_INST，轮询控制器模式；
// I2C0 = PA0(SDA)/PA1(SCL) 复用板载 LED 脚，通信期间 LED 微闪——地猛星 I2C0 的
// 另一组 PA28/PA31 已给 IMU601 UART0；PA1 板载 4.7k 上拉，PA0 上拉未焊 R12、
// 依赖 MPU6050 模块板自带）
I2C_0.$name                     = "I2C_0";
I2C_0.basicEnableController     = true;
I2C_0.basicControllerBusSpeed   = 400000;
I2C_0.peripheral.$assign        = "I2C0";
I2C_0.peripheral.sdaPin.$assign = "PA0";
I2C_0.peripheral.sclPin.$assign = "PA1";

// adc 模块 + 摇杆 + 模拟量测距共享 ADC12_0（b1-adc-servo/01 +
// wiki-modules-batch1/01 + wiki-modules-batch2/02/04：
// MEM0=PA24/A0_3 归 adc（us016/mq2 薄封装共读同槽——wiki-modules-batch2/02
// 与 batch6/03），MEM1=PA26/A0_1、
// MEM2=PA25/A0_2 归 joystick X/Y，MEM3=PA27/A0_0 归 ir_distance 红外测距
// （手册原脚）；轮询读取不配中断。多 MEM 必须 sequence 模式（startAdd..
// endAdd = 启用 MEM 集合）——单发模式只启用 startAdd 槽位，adcPin1/2 由此
// 不可用（原注释「槽位不存在」系误判，2026-09-05 SysConfig CLI 实证）
const ADC12   = scripting.addModule("/ti/driverlib/ADC12", {}, false);
const ADC12_0 = ADC12.addInstance();
ADC12_0.$name                      = "ADC12_0";
ADC12_0.sampClkSrc                 = "DL_ADC12_CLOCK_ULPCLK";
ADC12_0.sampClkDiv                 = "DL_ADC12_CLOCK_DIVIDE_8";
ADC12_0.sampleTime0                = "125 us";
ADC12_0.powerDownMode              = "DL_ADC12_POWER_DOWN_MODE_MANUAL";
ADC12_0.adcMem0chansel             = "DL_ADC12_INPUT_CHAN_3";
ADC12_0.adcMem1chansel             = "DL_ADC12_INPUT_CHAN_1";
ADC12_0.adcMem2chansel             = "DL_ADC12_INPUT_CHAN_2";
ADC12_0.adcMem3chansel             = "DL_ADC12_INPUT_CHAN_0";
ADC12_0.samplingOperationMode      = "sequence";
ADC12_0.startAdd                   = 0;
ADC12_0.endAdd                     = 3;
ADC12_0.peripheral.$assign         = "ADC0";
ADC12_0.peripheral.adcPin3.$assign = "PA24";
ADC12_0.peripheral.adcPin1.$assign  = "PA26";
ADC12_0.peripheral.adcPin2.$assign  = "PA25";
ADC12_0.peripheral.adcPin0.$assign = "PA27";
const Board = scripting.addModule("/ti/driverlib/Board", {}, false);
Board.configureUnused = true;

SYSCTL.forceDefaultClkConfig = true;
SYSCTL.clockTreeEn  = true;
